#==============================================================================
# ■ Window_NameEdit
#------------------------------------------------------------------------------
# 　ランダム名格納。
#==============================================================================

class Window_NameEdit < Window_Base
  #--------------------------------------------------------------------------
  # ● ランダム名
  #　　type 0:丸ごと取得 1:専用名のみ取得
  #--------------------------------------------------------------------------
  def random_name(type)
    common_name_list = []
    special_name_list = []
    # 共通の名前を取得(主人公は省く)
    if @actor != $game_actors[101]
      common_name_list = [
      "ルナ",
      "パプリカ",
      "ココア",
      "メルフェイナ",
      "フィーオレル",
      "メイネ",
      "レンドラ",
      "ユートナ",
      "エリージュ",
      "ベラヴェル",
      "ラーライ",
      "バニラ",
      "オーユリー",
      "ウーフラ",
      "レイネ",
      "トルルティ",
      "チューニア",
      "リューフリーデ",
      "アシュビ",
      "キュスーレ",
      "ミューウ",
      "ソフィス",
      "ソルニーア",
      "カローリス",
      "ディールワイス",
      "カルミリア",
      "カラン",
      "ターウ",
      "ブラッチェ",
      "ザティビィ",
      "エメリー",
      "レネンゲ",
      "フェニーチ",
      "カミーラ",
      "ミレユ",
      "クレセンナ",
      "ザレア",
      "テルパーム",
      "ルーレ",
      "シギ",
      "ネウル",
      "ビアンケ",
      "ハーユズ",
      "カルレン",
      "リンディア",
      "フィーニス",
      "フェルヴェ",
      "ルラヴェル",
      "アトリズ",
      "アンジェ",
      "フェーミヴェル",
      "ハヨネハヨナ",
      "エクリプメア",
      "ヌウイ",
      "ホリィ",
      "マーリカ",
      "サフォンス",
      "フフルル",
      "ミントア",
      "シア",
      "リュエル",
      "トリクシエ",
      ]
    else
      common_name_list = [
      "ロウラット"
      ]
    end
    # 種族毎の名前を追加
    case $data_classes[@actor.class_id].name
    #------------------------------------------------------------------------
    # ■■人間
    #------------------------------------------------------------------------
    when "人間"
      special_name_list = [
      "ロウラット",
      "ローレンス",
      "ロラン"
      ]
    #------------------------------------------------------------------------
    # ■■サキュバス種
    #------------------------------------------------------------------------
    when "レッサーサキュバス"
      special_name_list = [
      "レキ",
      "ディア",
      "チェリト",
      "ナンシー",
      "ミスドリーヴァ",
      "スー",
      "ラヴィ",
      "アモール",
      "アイニー",
      "リーヴ",
      "シータ",
      "プルクル",
      "ベルラ",
      "ニュー"
      ]
    when "サキュバス"
      special_name_list = [
      "レオーネ",
      "フィス",
      "フラウ",
      "エリス",
      "プロメティ",
      "ルカ",
      "ミリア",
      "リトリア",
      "ルルー",
      "コラプトー",
      "ミスティ",
      "カーラ",
      "エラスティ"
      ]
    when "サキュバスロード"
      special_name_list = [
      "エステラ",
      "ヴェネビアン",
      "ロッカブーケ",
      "マーヤー",
      "アーシェラ",
      "ヴォルヴェ",
      "アヌ",
      "ヴィヴィオ",
      "モーリア",
      "ティア",
      "シタール"
      ]
    #------------------------------------------------------------------------
    # ■■デビル種
    #------------------------------------------------------------------------
    when "インプ"
      special_name_list = [
      "ミニィ",
      "レムリン",
      "プラム",
      "ノーティ",
      "アル",
      "プティ",
      "ミーム",
      "ピックル",
      "フェイ",
      "レクルー"
      ]
    when "デビル"
      special_name_list = [
      "アイン",
      "カロル",
      "マール",
      "シオン",
      "リーゲル",
      "ファルス",
      "アミィ",
      "アンドレア",
      "ラヴィアン",
      "ラウラ"
      ]
    when "デーモン"
      special_name_list = [
      "グリセル",
      "ザピット",
      "ザスリッダ",
      "ニクシリース",
      "グラフゥア",
      "レーイン",
      "ラビエラ",
      "ノレラス",
      "アスター",
      "ベリオ"
      ]
    #------------------------------------------------------------------------
    # ■■ウィッチ種
    #------------------------------------------------------------------------
    when "プチウィッチ"
      special_name_list = [
      "ペトロニア",
      "サリィ",
      "キキ",
      "セオドア",
      "イザボー",
      "キュリオ",
      "ジニアス",
      "サレス",
      "パレッタ",
      "ティラ",
      "リトラット",
      "アリエイル"
      ]
    when "ウィッチ"
      special_name_list = [
      "レフィ",
      "ヴァネッサ",
      "ウィッカ",
      "エヴァ",
      "グリンディ",
      "ベネッタ",
      "マリー",
      "パーチェ",
      "マーゴ",
      "ディレッタ",
      "カンタンテ",
      "レアリーズ"
      ]
    #------------------------------------------------------------------------
    # ■■キャスト種
    #------------------------------------------------------------------------
    when "キャスト"
      special_name_list = [
      "アン",
      "ローラ",
      "マーガレット",
      "セーラ",
      "ウェンディ",
      "フローネ",
      "ココ",
      "キャシー",
      "イリア",
      "レベッカ",
      "フランソワ",
      "マリー",
      "クリス",
      "シー",
      "ジェーン"
      ]
    #------------------------------------------------------------------------
    # ■■スレイヴ種
    #------------------------------------------------------------------------
    when "スレイヴ"
      special_name_list = [
      "カシェーウ",
      "ウィダ",
      "サントメウ",
      "エルミネ",
      "タンジェア",
      "ソファール",
      "ゼーラ",
      "マルカラ",
      "カノン",
      ]
    #------------------------------------------------------------------------
    # ■■ナイトメア種
    #------------------------------------------------------------------------
    when "ナイトメア"
      special_name_list = [
      "ヒプノクス",
      "メスメリック",
      "イスレス",
      "カスメ",
      "マベル",
      "ティタ",
      "チュルル",
      "レム",
      "メリー",
      "メア",
      "メニッキ",
      "フロウ"
      ]
    #------------------------------------------------------------------------
    # ■■スライム種
    #------------------------------------------------------------------------
    when "スライム"
      special_name_list = [
      "ジェリー",
      "パロア",
      "プリン",
      "ムース",
      "ラティ",
      "スゥ",
      "パンナ",
      "ツムリ",
      "ベス",
      "バブル",
      "プルプル",
      "ライム"
      ]
    when "ゴールドスライム"
      special_name_list = [
      "エーユ",
      "ロクオン",
      "ミダーサ",
      "パックァ",
      "ハナキ",
      "ライディ",
      "イェロ",
      "ティアラ",
      "ナナジック",
      "イオロヨ"
      ]
    #------------------------------------------------------------------------
    # ■■ファミリア種
    #------------------------------------------------------------------------
    when "ファミリア"
      special_name_list = [
      "ロッタ",
      "シャリー",
      "ヴィオラ",
      "エミュー",
      "ペリア",
      "キーモラ",
      "シルク",
      "ルンヴァ",
      "ファーミ"
      ]
    #------------------------------------------------------------------------
    # ■■ワーウルフ種
    #------------------------------------------------------------------------
    when "ワーウルフ"
      special_name_list = [
      "ケルベ",
      "オルトロ",
      "エンリル",
      "ライカ",
      "ペリア",
      "ルーガルー",
      "ハティ",
      "スコル",
      "ハチコー"
      ]
    #------------------------------------------------------------------------
    # ■■ワーキャット種
    #------------------------------------------------------------------------
    when "ワーキャット"
      special_name_list = [
      "タマ",
      "バステッタ",
      "ケイ",
      "シーケット",
      "キーティ",
      "シュレーディン",
      "バターパン",
      "ニャミィ",
      "ネムレス",
      ]
    #------------------------------------------------------------------------
    # ■■ゴブリン種
    #------------------------------------------------------------------------
    when "ゴブリン"
      special_name_list = [
      "ピレデリー",
      "モグファーナ",
      "ガブルディ",
      "グラナダ",
      "ククリ",
      "フレイラ",
      "ニングスター",
      "ナクル",
      "モルタラ",
      "ダイナ",
      ]
    when "ギャングコマンダー"
      special_name_list = [
      "リンリー",
      "チーフティン",
      "アカボーシ",
      "ハートメン",
      "タヴーウ",
      "ボドュア",
      "ナオエ",
      "カンシン",
      "ザッピー",
      ]
    #------------------------------------------------------------------------
    # ■■プリーステス種
    #------------------------------------------------------------------------
    when "プリーステス"
      special_name_list = [
      "マリエール",
      "ウルスラ",
      "カタリナ",
      "アナスタシア",
      "アンナ",
      "ヴェロニカ",
      "ポロニア",
      "ジューリア",
      "エウラリア",
      ]
    #------------------------------------------------------------------------
    # ■■カースメイガス種
    #------------------------------------------------------------------------
    when "カースメイガス"
      special_name_list = [
      "マレフィ",
      "ゴーデル",
      "アースラ",
      "ラヴェンナ",
      "グリムヒルド",
      "ワルプ",
      "セーラム",
      "ベラトリックス",
      "ツスルク",
      ]
    #------------------------------------------------------------------------
    # ■■アルラウネ種
    #------------------------------------------------------------------------
    when "アルラウネ"
      special_name_list = [
      "ナミズキ",
      "ディジー",
      "アジサ",
      "チュラーダ",
      "ジキタリー",
      "クローヴァ",
      "ダリー",
      "ハイドレージ",
      "ホーズキ",
      ]
    #------------------------------------------------------------------------
    # ■■マタンゴ種
    #------------------------------------------------------------------------
    when "マタンゴ"
      special_name_list = [
      "カエン",
      "ササコ",
      "ツキヨ",
      "ドクツル",
      "ベニー",
      "シャグマ",
      "サウラ",
      "ワーライ",
      "マジーシュ",
      "エトリ",
      "ワナップ",
      ]
    #------------------------------------------------------------------------
    # ■■エンジェル種
    #------------------------------------------------------------------------
    when "ダークエンジェル"
      special_name_list = [
      "アスタール",
      "モアン",
      "ザゼル",
      "ベリア",
      "マスティ",
      "メリーク",
      "フルーレ",
      "シェム",
      "シャイタン",
      "イスラーフェ"
      ]
    #------------------------------------------------------------------------
    # ■■ガーゴイル種
    #------------------------------------------------------------------------
    when "ガーゴイル"
      special_name_list = [
      "グリサイユ",
      "ディアン",
      "イース",
      "ペリディ",
      "アムト",
      "ネリー",
      "コニア",
      "アズール"
      ]
    #------------------------------------------------------------------------
    # ■■ミミック種
    #------------------------------------------------------------------------
    when "ミミック"
      special_name_list = [
      "パンドラ",
      "キャビィ",
      "トラッペ",
      "ボルダーン",
      "コットリ",
      "コーフィン",
      "ハンマッキド",
      "ドロセラ",
      "ネペンタス",
      "フラートラ"
      ]
    #------------------------------------------------------------------------
    # ■■タマモ種
    #------------------------------------------------------------------------
    when "タマモ"
      special_name_list = [
      "イナリ",
      "ダッキ",
      "キュビー",
      "ヤコ",
      "ツネ",
      "ミョーブ",
      "カサマ",
      "フシミ",
      "ミクズ",
      "クズノ",
      "シノ",
      "ウシュカ"
      ]
    #------------------------------------------------------------------------
    # ■■リリム種
    #------------------------------------------------------------------------
    when "リリム"
      special_name_list = [
      "リアス",
      "グレーテ",
      "ドロシア",
      "リーゼ",
      "シンディ",
      "カーレーン",
      "タリーアー",
      "ラプッツェ",
      "レッドフーダ",
      ]
    end
    
    name_list = special_name_list
    name_list += common_name_list if name_list == []
    name_list += common_name_list if type == 0
    # 今付いている名前がある場合は省く
    name_list.delete(@name)
    return name_list
  end
end
